Revit 2026 API

# PDFExportOptionsExportQuality Property

---

The preferred export quality (DPI).

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public PDFExportQualityType ExportQuality { get; set; }
```
```vb
Public Property ExportQuality As PDFExportQualityType
	Get
	Set
```
```cpp
public:
property PDFExportQualityType ExportQuality {
	PDFExportQualityType get ();
	void set (PDFExportQualityType value);
}
```
```fsharp
member ExportQuality : PDFExportQualityType with get, set
```

#### Property Value

PDFExportQualityType

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

This quality setting is the equivalent of printer resolution found in advanced printer settings. An effect of the setting is to control tessellation quality.

#### Reference

PDFExportOptions Class

Autodesk.Revit.DB Namespace